## Introducing Pandas Objects
Starting from: page 102

In [8]:
area_dict = {'California': 423967, 
            'Texas': 695662,
            'New York': 141297,
            'Florida': 170312,
            'Illinois': 149995}

population_dict = {'California': 38332521,
                  'Texas': 26448193,
                  'New York': 19651127,
                  'Florida': 19552860,
                  'Illinois': 12882135}

In [7]:
import pandas as pd
area = pd.Series(area_dict)
area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
dtype: int64

In [9]:
population = pd.Series(population_dict)
population

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

In [10]:
states = pd.DataFrame({'population': population, 'area': area})
states

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [12]:
states.index

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [13]:
states.columns

Index(['area', 'population'], dtype='object')

In [15]:
_[1]

'population'

In [16]:
states.index = ['a', 'b', 'c', 'd', 'e']

In [17]:
states

     area  population
a  423967    38332521
b  170312    19552860
c  149995    12882135
d  141297    19651127
e  695662    26448193

In [19]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

In [21]:
indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [24]:
states_ind = states.index
indC = pd.Index(['a', 'c', 'x'])

states_ind & indC

Index(['a', 'c'], dtype='object')

In [25]:
indA | indB

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [26]:
indA ^ indB

Int64Index([1, 2, 9, 11], dtype='int64')

In [27]:
states = pd.DataFrame({'population': population, 'area': area})
states

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [29]:
data = states
data

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [36]:
coltt = data['population']

In [49]:
coltt.name = 'pop_new'
data

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [50]:
data['population'].name

'pop_new'

In [81]:
coltt[1] = 11
data.drop(['pop3'], axis = 1, inplace = True)

In [82]:
data

              area  population
California  423967    38332521
Florida     170312          11
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [83]:
data2 = data.copy()

In [84]:
data2

              area  population
California  423967    38332521
Florida     170312          11
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [86]:
data2['population'][1] = 22
data2 is data

False

In [89]:
data

              area  population
California  423967    38332521
Florida     170312          11
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193